toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        for (;;) {
//            _Scheduler::Sleep(_Scheduler::Ms(2000));
            
            _Scheduler::Wait([&] { return (bool)_Motion; });
            _Motion = false;
            
            _Pin::VDD_B_EN::Write(1);
            _Scheduler::Sleep(_Scheduler::Ms(250));
            
            for (;;) {
                _BusyAssertion busy;
                
                // Capture an image
                _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
                _ImgCapture();
                _ICE::Transfer(_ICE::LEDSetMsg(0x00));
                
                // Wait up to 1s for further motion
                const auto motion = _Scheduler::Wait(_Scheduler::Ms(1000), [] { return (bool)_Motion; });
                if (!motion) {
                    // We timed-out
                    // Asynchronously disable Img / SD
                    _Img::DisableAsync();
                    _SD::DisableAsync();
                    
                    // Wait until both Img and SD are disabled
                    _Scheduler::Wait<_ImgTask, _SDTask>();
                    // Relinquish our busy assertion by breaking out of scope,
                    // allowing us to enter LPM3.5 sleep
                    break;
                }
                
                // Only reset _Motion if we've observed motion; otherwise, if we always reset
                // _Motion, there'd be a race window where we could first observe
                // _Motion==false, but then the ISR sets _Motion=true, but then we clobber
                // the true value by resetting it to false.
                _Motion = false;
            }
            
            _Pin::VDD_B_EN::Write(0);
            
//            // Asynchronously turn off the image sensor / SD card
//            _Img::DisableAsync();
//            _SD::DisableAsync();
//            
//            _Scheduler::Wait([&] { return (_Img && _SD) || _Motion; });
//            
//            // Wait until the image sensor / SD card are off
//            _Img::Wait();
//            _SD::Wait();
//            
//            // Wait for motion
//            const bool motion = _Scheduler::WaitTimeout<1000>([&] { return _Motion; });
//            
//            if (motion) {
//                _Motion = false;
//                
//                // Capture an image
//                _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//                _ImgCapture();
//                _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            
//            } else {
//                // Asynchronously turn off the image sensor / SD card
//                _Img::DisableAsync();
//                _SD::DisableAsync();
//                
//                // Wait until the image sensor / SD card are off
//                _Img::Wait();
//                _SD::Wait();
//                
//                break;
//            }
//            
//            
//            
////            // Stop the timeout task while we capture a new image
////            _Scheduler::Stop<_BusyTimeoutTask>();
//            
//            
//            // Wait for motion
//            _Scheduler::Wait([&] { return _Motion; });
//            _Motion = false;
//            
//            _BusyAssertion busy;
//            
////            // Stop the timeout task while we capture a new image
////            _Scheduler::Stop<_BusyTimeoutTask>();
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            
//            // Capture an image
//            _ImgCapture();
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            
//            // wait for motion or 1s to elapse
//            // if motion:
//            //   capture another image
//            // if 1s elapses:
//            //   disable SD/Img
//            //   wait for: [1] _Motion or [2] (SD && Img)
//            //   if [1]: capture another image
//            //   if [2]: drop busy assertion and yield
//            
//            
//            // Tickle the busy task
//            _BusyTimeoutTask::Tickle();
//            
////            // Restart the timeout task, so that we turn off automatically if
////            // we're idle for a bit
////            _Scheduler::Start<_BusyTimeoutTask>(_BusyTimeoutTask::Run);
        }
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{
        .AutoStart = Run, // Task should start running
    };
    
    // Task stack
    [[gnu::section(".stack._MotionTask")]]
    static inline uint8_t Stack[256];
};

// MARK: - Abort

namespace AbortDomain {
    static constexpr uint16_t Invalid       = 0;
    static constexpr uint16_t General       = 1;
    static constexpr uint16_t Scheduler     = 2;
    static constexpr uint16_t ICE           = 3;
    static constexpr uint16_t SD            = 4;
    static constexpr uint16_t Img           = 5;
}

[[noreturn]]
static void _SchedulerError(uint16_t line) {
    _Abort(AbortDomain::Scheduler, line);
}

[[noreturn]]
static void _ICEError(uint16_t line) {
    _Abort(AbortDomain::ICE, line);
}

[[noreturn]]
static void _SDError(uint16_t line) {
    _Abort(AbortDomain::SD, line);
}

[[noreturn]]
static void _ImgError(uint16_t line) {
    _Abort(AbortDomain::Img, line);
}

static void _AbortRecord(const MSP::Time& timestamp, uint16_t domain, uint16_t line) {
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    auto& abort = _State.abort;
    if (abort.eventsCount >= std::size(abort.events)) return;
    
    abort.events[abort.eventsCount] = MSP::AbortEvent{
        .timestamp = timestamp,
        .domain = domain,
        .line = line,
    };
    
    abort.eventsCount++;
}

//[[noreturn]]
//static void _BOR() {
//    // Trigger a BOR
//    PMMCTL0 = PMMPW | PMMSWBOR;
//}

[[noreturn]]
static void _Abort(uint16_t domain, uint16_t line) {
    const MSP::Time timestamp = _RTC.time();
    // Record the abort
    _AbortRecord(timestamp, domain, line);
    // Trigger a BOR
    PMMCTL0 = PMMPW | PMMSWBOR;
    
